In [30]:
import pandas as pd

In [31]:

dados =pd.read_csv(r"/home/youx/Dados/venda-de-carros.csv")

In [32]:
dados

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [33]:
dados['Quantidade']= '>>'
grupos = dados.groupby('Quantidade')
grupos['Quantidade'].value_counts()
#Desafio 1

Quantidade
>>    10
Name: count, dtype: int64

In [ ]:
#Desafio 2 
variações = dados.query('Fabricante == "Honda" and Cor == "Branco"').reset_index()
variações

Empty DataFrame
Columns: [index, Fabricante, Cor, Quilometragem, Portas, Preco, Quantidade]
Index: []

In [ ]:
#Desafio 3
ds4 = dados.query('Cor == "Branco"').reset_index()
ds4

   index Fabricante     Cor  Quilometragem  Portas         Preco Quantidade
0      0     Toyota  Branco         150043       4  R$ 24,000.00         >>
1      4     Nissan  Branco         213095       4  R$ 13,500.00         >>
2      8     Toyota  Branco          60000       4  R$ 26,250.00         >>
3      9     Nissan  Branco          31600       4  R$ 19,700.00         >>

In [ ]:
#desafio 4
dados['Preco'].describe().to_frame()

               Preco
count             10
unique             9
top     R$ 27,000.00
freq               2

In [61]:
#desafio 5
cor = dados.query('Cor == "Branco"')
cor2 = dados.query('Cor == "Vermelho"')
cor , cor2

(  Fabricante     Cor  Quilometragem  Portas         Preco Quantidade
 0     Toyota  Branco         150043       4  R$ 24,000.00         >>
 4     Nissan  Branco         213095       4  R$ 13,500.00         >>
 8     Toyota  Branco          60000       4  R$ 26,250.00         >>
 9     Nissan  Branco          31600       4  R$ 19,700.00         >>,
   Fabricante       Cor  Quilometragem  Portas         Preco Quantidade
 1      Honda  Vermelho          87899       4  R$ 25,000.00         >>)

In [ ]:
#desafio 6

TypeError: 'DataFrame' object is not callable